app/views/pages/home.html.erb

    <div class="row">
      <%= render partial: 'annonces/annonce', collection: Annonce.order(created_at: :desc).limit(6) %>
---
SELECT "annonces".* FROM "annonces" ORDER BY "annonces"."created_at" DESC LIMIT ?  [["LIMIT", 6]]