app/views/annonces/index.html.erb

              <td><%= annonce.created_at.strftime("%d/%m/%Y") %></td>
              <td><%= annonce.user.email if annonce.user.present? %></td>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]