app/controllers/annonces_controller.rb

SELECT "annonces".* FROM "annonces" ORDER BY "annonces"."created_at" DESC
---
  def index
    @annonces = Annonce.order(created_at: :desc)

INSERT INTO "annonces" ("titre", "description", "prix", "categorie", "localisation", "user_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @annonce = current_user.annonces.build(annonce_params)

    if @annonce.save

UPDATE "annonces" SET "titre" = ?, "prix" = ?, "localisation" = ?, "updated_at" = ? WHERE "annonces"."id" = ?  [["titre", "Immeuble"], ["prix", 5000000.0], ["localisation", "Marrakech"], ["updated_at", "2025-04-29 02:04:47.974444"], ["id", 15]]
---
  def update
    if @annonce.update(annonce_params)

DELETE FROM "annonces" WHERE "annonces"."id" = ?  [["id", 12]]
---
  def destroy
    @annonce.destroy

SELECT "annonces".* FROM "annonces" WHERE "annonces"."user_id" = ? ORDER BY "annonces"."created_at" DESC  [["user_id", 1]]
---
  def mes_annonces
    @annonces = current_user.annonces.order(created_at: :desc)

SELECT "annonces".* FROM "annonces" WHERE "annonces"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def set_annonce
    @annonce = Annonce.find(params[:id])