app/controllers/users_controller.rb

INSERT INTO "users" ("nom", "prenom", "phone", "email", "password_digest", "created_at", "updated_at", "remember_digest", "admin") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE (nom LIKE '%kamal%' OR prenom LIKE '%kamal%' OR email LIKE '%kamal%')
SELECT "users".* FROM "users"
---
  def index
    if params[:q].present?
      @users = User.where("nom LIKE ? OR prenom LIKE ? OR email LIKE ?",
                           "%#{params[:q]}%", "%#{params[:q]}%", "%#{params[:q]}%")
    else
      @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "nom" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nom", "Rochdi"], ["email", "ahmedrochdi@gmail.com"], ["password_digest", "[FILTERED]"], ["updated_at", "2025-04-29 00:25:22.842003"], ["id", 3]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_user_or_admin
    @user = User.find(params[:id])